////=========================================================================================================
////
//// スコアの処理 [score.cpp]
//// Author : yabuki yukito
////
////=========================================================================================================
//
//#include "score.h"
//
////=========================================================================================================
////メイン関数
////=========================================================================================================
//
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////マクロ定義
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//#define MAX_NUM (8)										//スコア表示の最大数
//
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////グローバル変数
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//LPDIRECT3DTEXTURE9 g_TextureScore = NULL;				//テクスチャのポインタ
//LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffScore = NULL;			//頂点バッファへのポインタ
//D3DXVECTOR3 g_posScore;									//スコアの位置
//int g_nScore;											//スコアの値
//
////=========================================================================================================
////スコアの初期化処理
////=========================================================================================================
//void InitScore(void)
//{
//	LPDIRECT3DDEVICE9 pDevice;
//
//	//デバイスの取得
//	pDevice = GetDevice();
//
//	//テクスチャの読み込み
//	D3DXCreateTextureFromFile(pDevice,
//		"data\\texture\\number000.png",
//		&g_TextureScore);
//
//	g_posScore = D3DXVECTOR3();							//位置の初期化
//	g_nScore = 0;										//値を初期化
//
//	VERTEX_2D* pVtx;									//頂点情報へのポインタ
//
//		//頂点バッファの生成
//	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4 * 8,
//		D3DUSAGE_WRITEONLY,
//		FVF_VERTEX_2D,
//		D3DPOOL_MANAGED,
//		&g_pVtxBuffScore,
//		NULL);
//
//	//頂点バッファをロックし、頂点情報へのポインタを取得
//	g_pVtxBuffScore->Lock(0, 0, (void**)&pVtx, 0);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//スコアの
//		pVtx[0].pos = D3DXVECTOR3(950.0f  + nCount * 40.0f , 0.0f , 0.0f);
//		pVtx[1].pos = D3DXVECTOR3(990.0f + nCount * 40.0f , 0.0f , 0.0f);
//		pVtx[2].pos = D3DXVECTOR3(950.0f  + nCount * 40.0f , 50.0f, 0.0f);
//		pVtx[3].pos = D3DXVECTOR3(990.0f + nCount * 40.0f , 50.0f, 0.0f);
//
//		//rhwの設定
//		pVtx[0].rhw = 1.0f;
//		pVtx[1].rhw = 1.0f;
//		pVtx[2].rhw = 1.0f;
//		pVtx[3].rhw = 1.0f;
//
//		//頂点カラーの設定
//		pVtx[0].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[1].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[2].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[3].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//
//		//テクスチャ座標の設定
//		pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
//		pVtx[1].tex = D3DXVECTOR2(0.1f, 0.0f);
//		pVtx[2].tex = D3DXVECTOR2(0.0f, 0.1f);
//		pVtx[3].tex = D3DXVECTOR2(0.1f, 0.1f);
//
//		pVtx += 4;
//	}
//
//		//頂点情報をアンロック
//		g_pVtxBuffScore->Unlock();
//}
//
////=========================================================================================================
////スコアの終了処理
////=========================================================================================================
//void UninitScore(void)
//{
//	//テクスチャの破棄
//	if (g_TextureScore != NULL)
//	{
//		g_TextureScore->Release();
//		g_TextureScore = NULL;
//	}
//	//頂点バッファの破棄
//	if (g_pVtxBuffScore != NULL)
//	{
//		g_pVtxBuffScore->Release();
//		g_pVtxBuffScore = NULL;
//	}
//}
//
////=========================================================================================================
////スコアの更新処理
////=========================================================================================================
//void UpdateScore(void)
//{
//
//}
//
////=========================================================================================================
////スコアの描画処理
////=========================================================================================================
//void DrawScore(void)
//{
//	//必要桁数分の描画
//	LPDIRECT3DDEVICE9 pDevice;							//デバイスへのポインタ
//
//	//デバイスの取得
//	pDevice = GetDevice();
//
//	//頂点バッファをデータストリームに設定
//	pDevice->SetStreamSource(0, g_pVtxBuffScore, 0, sizeof(VERTEX_2D));
//
//	//頂点フォーマットの設定
//	pDevice->SetFVF(FVF_VERTEX_2D);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//テクスチャの設定
//		pDevice->SetTexture(0, g_TextureScore);
//
//		//テクスチャの描画
//		pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP,nCount *4,2);
//	}
//
//
//}
//
////=========================================================================================================
////スコアの設定処理
////=========================================================================================================
//void SetScore(int nScore)
//{
//	VERTEX_2D* pVtx{};									//頂点情報へのポインタ
//	int aPosTexU[8]{};									//各桁の数字を格納する
//	g_nScore = nScore;									//スコアの値を設定
//
//	aPosTexU[0] = g_nScore % 100000000/ 10000000;
//	aPosTexU[1]	= g_nScore % 10000000/ 1000000;
//	aPosTexU[2]	= g_nScore % 1000000/ 100000;
//	aPosTexU[3]	= g_nScore % 100000/ 10000;
//	aPosTexU[4]	= g_nScore % 10000/ 1000;
//	aPosTexU[5]	= g_nScore % 1000/ 100;
//	aPosTexU[6]	= g_nScore % 100/ 10;
//	aPosTexU[7]	= g_nScore % 10/ 1;
//
//	//頂点バッファをロックし、頂点情報へのポインタを取得
//	g_pVtxBuffScore->Lock(0, 0, (void**)&pVtx, 0);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//テクスチャ座標の設定
//		pVtx[0].tex = D3DXVECTOR2(0.0f + aPosTexU[nCount] * 0.1f, 0.0f);
//		pVtx[1].tex = D3DXVECTOR2(0.1f + aPosTexU[nCount] * 0.1f, 0.0f);
//		pVtx[2].tex = D3DXVECTOR2(0.0f + aPosTexU[nCount] * 0.1f, 1.0f);
//		pVtx[3].tex = D3DXVECTOR2(0.1f + aPosTexU[nCount] * 0.1f, 1.0f);
//
//		pVtx += 4;
//	}			
//	//頂点情報をアンロック
//	g_pVtxBuffScore->Unlock();
//}
//
////=========================================================================================================
////スコアの加算処理
////=========================================================================================================
//void AddScore(int nValue)
//{
//	VERTEX_2D* pVtx{};									//頂点情報へのポインタ
//
//	int aPosTexU[8]{};									//各桁の数字を格納する
//	g_nScore += nValue;									//スコアの値を加算する
//
//	aPosTexU[0] = g_nScore % 100000000 / 10000000;
//	aPosTexU[1] = g_nScore % 10000000 / 1000000;
//	aPosTexU[2] = g_nScore % 1000000 / 100000;
//	aPosTexU[3] = g_nScore % 100000 / 10000;
//	aPosTexU[4] = g_nScore % 10000 / 1000;
//	aPosTexU[5] = g_nScore % 1000 / 100;
//	aPosTexU[6] = g_nScore % 100 / 10;
//	aPosTexU[7] = g_nScore % 10 / 1;
//
//	//頂点バッファをロックし、頂点情報へのポインタを取得
//	g_pVtxBuffScore->Lock(0, 0, (void**)&pVtx, 0);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//テクスチャ座標の設定
//		pVtx[0].tex = D3DXVECTOR2(0.0f + aPosTexU[nCount] * 0.1f, 0.0f);
//		pVtx[1].tex = D3DXVECTOR2(0.1f + aPosTexU[nCount] * 0.1f, 0.0f);
//		pVtx[2].tex = D3DXVECTOR2(0.0f + aPosTexU[nCount] * 0.1f, 1.0f);
//		pVtx[3].tex = D3DXVECTOR2(0.1f + aPosTexU[nCount] * 0.1f, 1.0f);
//
//		pVtx += 4;
//	}
//
//	//頂点情報をアンロック
//	g_pVtxBuffScore->Unlock();
//}
//
////=========================================================================================================
////スコアの取得処理
////=========================================================================================================
//int GetScore(void)
//{
//	return g_nScore;									//スコアの値を返す
//}
