////=============================================================================
////
//// サウンド処理 [sound.h]
//// Author : yabuki yukito
////
////=============================================================================
//#ifndef _SOUND_H_
//#define _SOUND_H_
//
//#include "main.h"
//
////*****************************************************************************
//// サウンド一覧
////*****************************************************************************
//typedef enum
//{
//	SOUND_LABEL_BGM = 0,
//	SOUND_LABEL_SHOT01,
//	SOUND_LABEL_MAX,
//} SOUND_LABEL;
//
////*****************************************************************************
//// プロトタイプ宣言
////*****************************************************************************
//HRESULT InitSound(HWND hWnd);
//void UninitSound(void);
//HRESULT PlaySound(SOUND_LABEL label);
//void StopSound(SOUND_LABEL label);
//void StopSound(void);
//
//#endif
