////=========================================================================================================
////
//// 時間の処理 [time.cpp]
//// Author : yabuki yukito
////
////=========================================================================================================
//
//#include "time.h"
//
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////マクロ定義
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//#define MAX_NUM (3)			//タイム表示の最大数
//
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
////グローバル変数
////+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//LPDIRECT3DTEXTURE9 g_TextureTime = NULL;			//タイムのテクスチャへのポインタ
//LPDIRECT3DVERTEXBUFFER9 g_pVtxBuffTime = NULL;		//タイムの頂点座標へのポインタ
//D3DXVECTOR3 g_posTime;								//タイムの位置
//int g_nTime;										//タイムの値
//
////=========================================================================================================
////メイン関数
////=========================================================================================================
//
////=========================================================================================================
////タイムの初期化処理
////=========================================================================================================
//void InitTime()
//{
//	LPDIRECT3DDEVICE9 pDevice;
//
//	//デバイスの取得
//	pDevice = GetDevice();
//
//	//テクスチャへの読込
//	D3DXCreateTextureFromFile(pDevice,
//		"data\\texture\\",
//		&g_TextureTime);
//
//	g_posTime = D3DXVECTOR3();						//位置の初期化
//	g_nTime = 0;									//値を初期化
//
//	VERTEX_2D* pVtx;								//頂点情報へのポインタ
//
//	//頂点バッファの生成
//	pDevice->CreateVertexBuffer(sizeof(VERTEX_2D) * 4 * 8,
//		D3DUSAGE_WRITEONLY,
//		FVF_VERTEX_2D,
//		D3DPOOL_MANAGED,
//		&g_pVtxBuffTime,
//		NULL);
//
//	//頂点バッファをロックし、頂点情報へのポインタを取得
//	g_pVtxBuffTime->Lock(0, 0, (void**)&pVtx, 0);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//頂点座標の設定(タイム)
//		pVtx[0].pos = D3DXVECTOR3(950.0f + nCount * 40.0f, 0.0f, 0.0f);
//		pVtx[1].pos = D3DXVECTOR3(990.0f + nCount * 40.0f, 0.0f, 0.0f);
//		pVtx[2].pos = D3DXVECTOR3(950.0f + nCount * 40.0f, 50.0f, 0.0f);
//		pVtx[3].pos = D3DXVECTOR3(990.0f + nCount * 40.0f, 50.0f, 0.0f);
//
//		//rhwの設定
//		pVtx[0].rhw = 1.0f;
//		pVtx[1].rhw = 1.0f;
//		pVtx[2].rhw = 1.0f;
//		pVtx[3].rhw = 1.0f;
//
//		//頂点カラーの設定(タイム)
//		pVtx[0].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[1].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[2].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//		pVtx[3].col = D3DCOLOR_RGBA(255, 255, 255, 255);
//
//		//テクスチャ座標の設定
//		pVtx[0].tex = D3DXVECTOR2(0.0f, 0.0f);
//		pVtx[1].tex = D3DXVECTOR2(0.1f, 0.0f);
//		pVtx[2].tex = D3DXVECTOR2(0.0f, 0.1f);
//		pVtx[3].tex = D3DXVECTOR2(0.1f, 0.1f);
//
//		pVtx += 4;
//	}
//
//	//頂点情報をアンロック
//	g_pVtxBuffTime->Unlock();
//
//}
//
////=========================================================================================================
////タイムの終了処理
////=========================================================================================================
//void UninitTime()
//{
//	//テクスチャの破棄
//	if (g_TextureTime != NULL)
//	{
//		g_TextureTime->Release();
//		g_TextureTime = NULL;
//	}
//	//頂点バッファの破棄
//	if (g_pVtxBuffTime != NULL)
//	{
//		g_pVtxBuffTime->Release();
//		g_pVtxBuffTime = NULL;
//	}
//}
//
////=========================================================================================================
////タイムの更新処理
////=========================================================================================================
//void UpdateTime()
//{
//
//}
//
////=========================================================================================================
////タイムの描画処理
////=========================================================================================================
//void DrawTime()
//{
//	//必要桁数分の描画
//	LPDIRECT3DDEVICE9 pDevice;							//デバイスへのポインタ
//
//	//デバイスの取得
//	pDevice = GetDevice();
//
//	//頂点バッファをデータストリームに設定
//	pDevice->SetStreamSource(0, g_pVtxBuffTime, 0, sizeof(VERTEX_2D));
//
//	//頂点フォーマットの設定
//	pDevice->SetFVF(FVF_VERTEX_2D);
//
//	for (int nCount = 0; nCount < MAX_NUM; nCount++)
//	{
//		//テクスチャの設定
//		pDevice->SetTexture(0, g_TextureTime);
//
//		//テクスチャの描画
//		pDevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, nCount * 4, 2);
//	}
//}
//
////=========================================================================================================
////タイムの設定処理
////=========================================================================================================
//void SetTime(int nTime)
//{
//	VERTEX_2D* pVtx{};									//頂点情報へのポインタ
//	int aPosTexU[8]{};									//各桁の数字を格納する
//	g_nTime = nTime;									//スコアの値を設定
//}
//
////=========================================================================================================
////タイムの減算処理
////=========================================================================================================
//void AddTime()
//{
//
//}
//
////=========================================================================================================
////タイムの取得処理
////=========================================================================================================
//int GetTime()
//{
//
//}